# max и min
# Дано натуральное число n(n≥10)Напишите программу, которая определяет его максимальную и минимальную цифры и выводит текст в следующем формате:

# Максимальная цифра равна <максимальная цифра>
# Минимальная цифра равна <минимальная цифра>

n = input()  

print("Максимальная цифра равна", max(n))
print("Минимальная цифра равна", min(n))